In [591]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import re

In [592]:
df = pd.read_csv('../../datasets/csv_datasets/listings.csv')

In [593]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39160 entries, 0 to 39159
Data columns (total 18 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   id                              39160 non-null  int64
 1   name                            39160 non-null  object
 2   host_id                         39160 non-null  int64
 3   host_name                       39155 non-null  object
 4   neighbourhood_group             39160 non-null  object
 5   neighbourhood                   39160 non-null  object
 6   latitude                        39160 non-null  float64
 7   longitude                       39160 non-null  float64
 8   room_type                       39160 non-null  object
 9   price                           39160 non-null  int64
 10  minimum_nights                  39160 non-null  int64
 11  number_of_reviews               39160 non-null  int64
 12  last_review                     28211 non-null  object
 13  reviews_per_month               28211 non-null  float64
 14  calculated_host_listings_count  39160 non-null  int64
 15  availability_365                39160 non-null  int64
 16  number_of_reviews_ltm           39160 non-null  int64
 17  license                         3879 non-null   object
dtypes: float64(3), int64(8), object(7)
memory usage: 5.4+ MB

In [594]:
df.head(3)

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license
0,2595,Rental unit in New York · ★4.68 · Studio · 1 b...,2845,Jennifer,Manhattan,Midtown,40.75356,-73.98559,Entire home/apt,240,30,49,2022-06-21,0.29,3,365,0,NaN
1,5121,Rental unit in Brooklyn · ★4.52 · 1 bedroom · ...,7356,Garon,Brooklyn,Bedford-Stuyvesant,40.68535,-73.95512,Private room,66,30,50,2019-12-02,0.28,2,120,0,NaN
2,9357,Rental unit in New York · ★4.52 · Studio · 1 b...,30193,Tommi,Manhattan,Hell's Kitchen,40.76724,-73.98664,Entire home/apt,175,45,58,2017-08-13,0.34,1,340,0,NaN

### 1 Rename and modify:
- 'room_type' column as 'bnb_type';
- 'availability_365' column as 'availability_rate_365', calculate avoilability rate;

In [595]:
j = df

In [596]:
df = df.rename({'room_type': 'bnb_type'}, axis="columns")

In [597]:
df.head(1)

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,bnb_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license
0,2595,Rental unit in New York · ★4.68 · Studio · 1 b...,2845,Jennifer,Manhattan,Midtown,40.75356,-73.98559,Entire home/apt,240,30,49,2022-06-21,0.29,3,365,0,NaN

In [598]:
df

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,bnb_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license
0,2595,Rental unit in New York · ★4.68 · Studio · 1 b...,2845,Jennifer,Manhattan,Midtown,40.753560,-73.985590,Entire home/apt,240,30,49,2022-06-21,0.29,3,365,0,NaN
1,5121,Rental unit in Brooklyn · ★4.52 · 1 bedroom · ...,7356,Garon,Brooklyn,Bedford-Stuyvesant,40.685350,-73.955120,Private room,66,30,50,2019-12-02,0.28,2,120,0,NaN
2,9357,Rental unit in New York · ★4.52 · Studio · 1 b...,30193,Tommi,Manhattan,Hell's Kitchen,40.767240,-73.986640,Entire home/apt,175,45,58,2017-08-13,0.34,1,340,0,NaN
3,6848,Rental unit in Brooklyn · ★4.58 · 2 bedrooms ·...,15991,Allen & Irina,Brooklyn,Williamsburg,40.709350,-73.953420,Entire home/apt,81,30,191,2023-08-14,1.09,1,110,5,NaN
4,10452,Rental unit in Brooklyn · ★4.65 · 1 bedroom · ...,35935,Angela,Brooklyn,Bedford-Stuyvesant,40.682940,-73.956820,Private room,90,30,80,2023-09-16,0.49,4,290,2,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
39155,1013632380355599044,Rental unit in New York · ★New · 1 bedroom · 1...,401202937,Eliza,Manhattan,Midtown,40.747829,-73.986907,Private room,64,1,0,NaN,NaN,56,62,0,Exempt
39156,1014579690057145481,Rental unit in Brooklyn · ★New · 1 bedroom · 3...,441448134,Bailey,Brooklyn,Bedford-Stuyvesant,40.689207,-73.936728,Entire home/apt,119,30,0,NaN,NaN,1,258,0,NaN
39157,1015027293549591335,Rental unit in New York · ★New · 1 bedroom · 1...,107434423,Blueground,Manhattan,Kips Bay,40.744972,-73.977042,Entire home/apt,266,31,0,NaN,NaN,647,333,0,NaN
39158,1015027813525407338,Rental unit in New York · ★New · 2 bedrooms · ...,107434423,Blueground,Manhattan,Kips Bay,40.740508,-73.978347,Entire home/apt,322,31,0,NaN,NaN,647,365,0,NaN
39159,1015028181966283124,Rental unit in New York · ★New · 1 bedroom · 1...,107434423,Blueground,Manhattan,Kips Bay,40.739918,-73.978986,Entire home/apt,233,31,0,NaN,NaN,647,365,0,NaN

## 3. Retrieve the columns:
- 'name'
- 'rate';
- 'room_type'
- 'n_beds'
- 'n_baths'
- 'is_shared_bath'

In [599]:
name = df["name"].str.extract(r'([\w\s]+) ·')
name.head()

                         0
0  Rental unit in New York
1  Rental unit in Brooklyn
2  Rental unit in New York
3  Rental unit in Brooklyn
4  Rental unit in Brooklyn

In [600]:
rate = df["name"].str.extract(r'★([\d\w\.]{0,4}) ·')
rate.head()

      0
0  4.68
1  4.52
2  4.52
3  4.58
4  4.65

Some rows in 'name' column have a non-numeric rate or don't have a rate.

In [601]:
df.loc[rate[0] == "New",'name'] = df.loc[rate[0] == "New",'name'].str.replace('★[\w]{0,4}', "★0.00", regex=True)

In [602]:
df.loc[rate[0] == "New", 'name'].head(10)

3316     Home in Queens · ★0.00 · 1 bedroom · 1 bed · 1...
3412     Rental unit in New York · ★0.00 · 1 bedroom · ...
3763     Home in Brooklyn · ★0.00 · 5 bedrooms · 1 bed ...
8217     Rental unit in Queens · ★0.00 · 1 bedroom · 1 ...
8906     Condo in New York · ★0.00 · 1 bedroom · 2 beds...
11685    Rental unit in Brooklyn · ★0.00 · Studio · 1 b...
11821    Rental unit in New York · ★0.00 · 1 bedroom · ...
13294    Guesthouse in Brooklyn · ★0.00 · 1 bedroom · 2...
14479    Rental unit in Brooklyn · ★0.00 · Studio · 1 bath
14556    Rental unit in New York · ★0.00 · 2 bedrooms ·...
Name: name, dtype: object

Add '★0.00' in 'name' column of the dataframe where rate value is missing

In [603]:
name_list = [s.split("·", 2) for s in df['name']]
temp_list = name_list.copy()

for i,l in enumerate(name_list):
    s = np.where("★" in l[1], "·".join(l), "·".join( [l[0], " ★0.00 "] + l[1:] ) )
    temp_list[i] = str(s)

In [604]:
df['name'] = temp_list

Rate recalculation from clean dataframe

In [605]:
rate = df["name"].str.extract(r'★([\d\w\.]{0,4}) ·')
rate[0].value_counts()

0
0.00    17232
5.0      3971
4.67      804
4.75      681
4.83      611
        ...
3.77        1
4.02        1
3.30        1
3.36        1
3.70        1
Name: count, Length: 163, dtype: int64

In [606]:
room_type = df["name"].str.extract(r'★[\d\.]{1,4} · ([\d\s\w]+)')
room_type[0] = room_type[0].str.rstrip()
room_type.head()

            0
0      Studio
1   1 bedroom
2      Studio
3  2 bedrooms
4   1 bedroom

In [607]:
room_type[0].value_counts()

0
1 bedroom      26013
2 bedrooms      6300
Studio          3281
3 bedrooms      2365
4 bedrooms       800
5 bedrooms       247
6 bedrooms        62
1 bed             34
7 bedrooms        19
9 bedrooms        11
2 beds            10
8 bedrooms         6
3 beds             3
10 bedrooms        2
11 bedrooms        2
14 bedrooms        1
21 bedrooms        1
26 bedrooms        1
2 baths            1
15 bedrooms        1
Name: count, dtype: int64

For all the bnb without a room type replace the type with '1 bedroom'

In [608]:
room_type[0] = room_type[0].replace({"2 baths": "1 bedroom", "1 bed":"1 bedroom", "2 beds":"1 bedroom", "3 beds":"1 bedroom"})

In [609]:
room_type[0].value_counts()

0
1 bedroom      26061
2 bedrooms      6300
Studio          3281
3 bedrooms      2365
4 bedrooms       800
5 bedrooms       247
6 bedrooms        62
7 bedrooms        19
9 bedrooms        11
8 bedrooms         6
10 bedrooms        2
11 bedrooms        2
14 bedrooms        1
21 bedrooms        1
26 bedrooms        1
15 bedrooms        1
Name: count, dtype: int64

In [610]:
n_beds = df['name'].str.extract(r'([\d\.]+) bed[s]?\s*')

For the rows without beds the default value is 0

In [611]:
n_beds.loc[n_beds[0].isna(), 0] = n_beds.loc[n_beds[0].isna(), 0].replace({np.nan: 0})

In [612]:
n_beds[0].value_counts()

0
1     28491
2      6908
3      2485
4       818
5       249
0       102
6        63
7        19
9        11
8         6
10        2
11        2
14        1
21        1
26        1
15        1
Name: count, dtype: int64

In [613]:
import re

In [614]:
s = 'Rental unit in New York · ★4.52 · Studio · 1 bed · 1 bath'
s1 = 'Rental unit in New York · ★4.76 · 1 bedroom · 1 bed · 1 private bath'

#print(re.findall(r'^.+\s·\s(\d\s[shared|private]?\s[Half-]?bath?s?)', s1))
print(re.findall(r'(\d\.?\d?( shared| private)?\s[Half-]?bath?s?)', s1)[0])

('1 private bath', ' private')

In [615]:
names = df['name']

In [616]:
baths = df['name'].str.extract(r'(\d\.?\d?( shared| private)?\s[Half-]?bath?s?)')[0].fillna('1 shared bath')

In [617]:
baths.value_counts()

0
1 bath              20317
1 shared bath        8506
2 baths              2907
1 private bath       2823
2 shared baths       1162
1.5 baths            1104
1.5 shared baths      621
0 shared baths        436
3 baths               387
2.5 baths             361
4 baths               138
3 shared baths         83
3.5 baths              78
2.5 shared baths       77
0 baths                55
4.5 baths              37
4 shared baths         30
5 baths                15
6 baths                 6
5.5 baths               5
6.5 baths               4
4.5 shared baths        2
3.5 shared baths        1
7 baths                 1
6 shared baths          1
8.5 baths               1
7.5 baths               1
8 baths                 1
Name: count, dtype: int64

In [618]:
baths = baths.replace('0 shared baths', '1 shared bath')
baths = baths.replace('0 baths', '1 shared bath')

In [619]:
baths.value_counts()

0
1 bath              20317
1 shared bath        8997
2 baths              2907
1 private bath       2823
2 shared baths       1162
1.5 baths            1104
1.5 shared baths      621
3 baths               387
2.5 baths             361
4 baths               138
3 shared baths         83
3.5 baths              78
2.5 shared baths       77
4.5 baths              37
4 shared baths         30
5 baths                15
6 baths                 6
5.5 baths               5
6.5 baths               4
4.5 shared baths        2
3.5 shared baths        1
7 baths                 1
6 shared baths          1
8.5 baths               1
7.5 baths               1
8 baths                 1
Name: count, dtype: int64

There are rows with only "bath", "shared Half-bath" or other stuff like this. In this case I consider 0.5 when there is "Half|half", 0 otherwise.

In [620]:
n_baths = baths.str.split(r'\s').str[0].astype(dtype='float64').round().astype(dtype='int64')
n_baths

0        1
1        1
2        1
3        1
4        1
        ..
39155    2
39156    1
39157    1
39158    1
39159    1
Name: 0, Length: 39160, dtype: int64

In [621]:
is_shared_bath = baths.str.split(r'\s').str[1]
is_shared_bath = is_shared_bath.map(lambda x: True if x == 'shared' else False)

In [622]:
is_shared_bath

0        False
1         True
2        False
3        False
4         True
         ...
39155    False
39156    False
39157    False
39158    False
39159    False
Name: 0, Length: 39160, dtype: bool

## 6. Update dataframe with new columns

In [623]:
df['name'] = name

In [624]:
df['rate'] = rate.astype(dtype='float')

In [625]:
df['room_type'] = room_type

In [626]:
n_beds

       0
0      1
1      1
2      1
3      2
4      1
...   ..
39155  1
39156  1
39157  1
39158  2
39159  1

[39160 rows x 1 columns]

In [627]:
df['n_beds'] = n_beds[0].astype('int64')

In [628]:
n_baths[0]

1

In [629]:
df['n_baths'] = n_baths[0]

In [630]:
df['is_bath_shared'] = is_shared_bath

In [631]:
df.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,bnb_type,price,...,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license,rate,room_type,n_beds,n_baths,is_bath_shared
0,2595,Rental unit in New York,2845,Jennifer,Manhattan,Midtown,40.75356,-73.98559,Entire home/apt,240,...,0.29,3,365,0,NaN,4.68,Studio,1,1,False
1,5121,Rental unit in Brooklyn,7356,Garon,Brooklyn,Bedford-Stuyvesant,40.68535,-73.95512,Private room,66,...,0.28,2,120,0,NaN,4.52,1 bedroom,1,1,True
2,9357,Rental unit in New York,30193,Tommi,Manhattan,Hell's Kitchen,40.76724,-73.98664,Entire home/apt,175,...,0.34,1,340,0,NaN,4.52,Studio,1,1,False
3,6848,Rental unit in Brooklyn,15991,Allen & Irina,Brooklyn,Williamsburg,40.70935,-73.95342,Entire home/apt,81,...,1.09,1,110,5,NaN,4.58,2 bedrooms,2,1,False
4,10452,Rental unit in Brooklyn,35935,Angela,Brooklyn,Bedford-Stuyvesant,40.68294,-73.95682,Private room,90,...,0.49,4,290,2,NaN,4.65,1 bedroom,1,1,True

In [632]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39160 entries, 0 to 39159
Data columns (total 23 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   id                              39160 non-null  int64
 1   name                            39160 non-null  object
 2   host_id                         39160 non-null  int64
 3   host_name                       39155 non-null  object
 4   neighbourhood_group             39160 non-null  object
 5   neighbourhood                   39160 non-null  object
 6   latitude                        39160 non-null  float64
 7   longitude                       39160 non-null  float64
 8   bnb_type                        39160 non-null  object
 9   price                           39160 non-null  int64
 10  minimum_nights                  39160 non-null  int64
 11  number_of_reviews               39160 non-null  int64
 12  last_review                     28211 non-null  object
 13  reviews_per_month               28211 non-null  float64
 14  calculated_host_listings_count  39160 non-null  int64
 15  availability_365                39160 non-null  int64
 16  number_of_reviews_ltm           39160 non-null  int64
 17  license                         3879 non-null   object
 18  rate                            39160 non-null  float64
 19  room_type                       39160 non-null  object
 20  n_beds                          39160 non-null  int64
 21  n_baths                         39160 non-null  int64
 22  is_bath_shared                  39160 non-null  bool
dtypes: bool(1), float64(4), int64(10), object(8)
memory usage: 6.6+ MB

In [633]:
df.to_csv('../out/listings.csv', index=False)